-- ============================================================================
-- Файл: sp_master_etl.sql
-- Описание: Главная процедура ETL-пайплайна.
--           Выполняет все этапы последовательно.
-- ============================================================================

USE BI_DWH;
GO

CREATE OR ALTER PROCEDURE elt.sp_master_etl
AS
BEGIN
    SET NOCOUNT ON;
    SET XACT_ABORT ON;

    BEGIN TRY

        PRINT '========================================';
        PRINT 'START ETL HELL';
        PRINT '========================================';

        -- ================================================================
        -- 0. STAGING
        -- Загрузка новых CSV из /import
        -- ================================================================

        PRINT '0/7 Load staging...';

        EXEC elt.sp_load_staging_from_import;


        -- ================================================================
        -- 1. ODS
        -- Валидация оборотной ведомости
        -- ================================================================

        PRINT '1/7 Validate turnover...';

        EXEC elt.sp_validate_turnover;


        -- ================================================================
        -- 2. ODS
        -- Валидация цен
        -- ================================================================

        PRINT '2/7 Validate prices...';

        EXEC elt.sp_validate_prices;


        -- ================================================================
        -- 3. ODS
        -- Валидация складов
        -- ================================================================

        PRINT '3/7 Validate warehouses...';

        EXEC elt.sp_validate_warehouses;


        -- ================================================================
        -- 4. DWH
        -- Загрузка измерения материалов
        -- ================================================================

        PRINT '4/7 Load dim_material...';

--         EXEC dwh.sp_load_dim_material;


        -- ================================================================
        -- 5. DWH
        -- Загрузка измерения складов (SCD Type 2)
        -- ================================================================

        PRINT '5/7 Load dim_warehouse...';

        EXEC dwh.sp_load_dim_warehouse;


        -- ================================================================
        -- 6. DWH
        -- Загрузка факта оборотов
        -- ================================================================

        PRINT '6/7 Load fact_inventory...';

        EXEC dwh.sp_load_fact_inventory;


        -- ================================================================
        -- 7. DWH
        -- Загрузка факта цен
        -- ================================================================

        PRINT '7/7 Load fact_prices...';

        EXEC dwh.sp_load_fact_prices;
--

        PRINT '========================================';
        PRINT 'ETL COMPLETED SUCCESSFULLY';
        PRINT '========================================';

    END TRY
    BEGIN CATCH

        PRINT '========================================';
        PRINT 'ETL FAILED';
        PRINT '========================================';

        PRINT CONCAT(
                'Error ',
                ERROR_NUMBER(),
                ': ',
                ERROR_MESSAGE()
              );

        THROW;

    END CATCH;
END;
GO